{
	"plugins":{
		"surveyPlugin":"data.scripts.replacementscripts.SurveyPluginImpl",
	},
	"ruleCommandPackages":[
		"data.scripts.replacementscripts.Salvage",
		"data.scripts.starfarer.api.impl.campaign.rulemd",
	],



	#settings for AIRetrofits hullmod
	"AIRetrofits_AIretrofit_SUPPLY_USE_MULT":1.0,#and by multi, i mean increase multi. zero whould be no supply change. -1 would be no supply cost.
	"AIRetrofits_AIretrofit_CREW_USE_MULT":0,
	"AIRetrofits_AIretrofit_REPAIR_LOSE":0.5,

	#settings for robot forge power.
	"AIRetrofits_CorruptedMetal":0.025,
	"AIRetrofits_PristineMetal":0.075,
	#"AIRetrofits_SalvageGantry":0.10,
	"AIRetrofits_RobotForgePerCrewMulti":0.002,

	#settings for robotCost and forgeSpeed
	#S is build speed
	#B is robot output number
	#D is for description
	#N is name of an requirement
	#C is required amount of this item per robot output.
	#salvage robots
	"AIRetrofits_Sa_S":1,
	"AIRetrofits_Sa_B":1,
	"AIRetrofits_Sa_D":"produce salvage drones. they are about an ton in size, and somewhat ramshackle. They are built with many arms that are designed to hold any tools that they might need for whatever mission they move on, as well as anchor themselves to whatever they might have to when salvaging. controlled from the command ship, they tend to operate very well, but accidents can still accor do to there lack of creativity when in the filed. this is barely enough to offset the disadvantages of using salvaging drones in tasks, making them about as effective as normal crew.",
	"AIRetrofits_Sa_1N":"metals",
	"AIRetrofits_Sa_1C":0.7,
	"AIRetrofits_Sa_2N":"rare_metals",		
	"AIRetrofits_Sa_2C":0.1,
	"AIRetrofits_Sa_3N":"heavy_machinery",		
	"AIRetrofits_Sa_3C":0.15,

	#survey robots
	"AIRetrofits_Su_S":1,
	"AIRetrofits_Su_B":1,
	"AIRetrofits_Su_D":"produce survey drones. do to all the features that need to be put into the drone to make it function at this level, it is very large. about 1.5 tons per drone. survey drones are built with the ability to collect samples of anything they find. also outfitted with sensors to detect geological activity, as well as complex sensors that are capable of analyzing the land around them for anything from sines of life, to mineral deposits, and anything between. coupled with a somewhat complex custom AI, makes them very good at there job. well this is not always enough to overcome the downsides of they not using human crew results in, they are overall mush more effective then crew at there job.",
	"AIRetrofits_Su_1N":"metals",		
	"AIRetrofits_Su_1C":0.8,
	"AIRetrofits_Su_2N":"rare_metals",		
	"AIRetrofits_Su_2C":0.11,
	"AIRetrofits_Su_3N":"volatiles",		
	"AIRetrofits_Su_3C":0.096,

	#combat robots
	"AIRetrofits_Co_S":1,
	"AIRetrofits_Co_B":2,
	"AIRetrofits_Co_D":"produce combat drones. larger then an average Marine in full combat armor and somewhat patchwork in design, they are none the less capable of being outfitted with many different weapons upon there mounts before combat. they are controlled remotely from the command room of your flagship when preforming combat operations. despite the in theory advantages that the Combat Robots offer, they tend to severely under preform in combat. the drones are slow to react in combat, do to the fact that there command ship must process most of there movements beforehand. they often take seconds to realize they are under attack before returning fire, causing increased losses. the alternative, wish is to give them all an primitive AI, is worse. as it results in the drones walking into kill zones and fortifications unknowingly, as well as a lack of coordination causing manny to fall to the same kill zones before they can be overcome. the only upside, is they are quite small, at 1 tons, and capable of fighting in almost any environment. best used in large numbers.",
	"AIRetrofits_Co_1N":"metals",		
	"AIRetrofits_Co_1C":0.82,
	"AIRetrofits_Co_2N":"rare_metals",		
	"AIRetrofits_Co_2C":0.124,
	"AIRetrofits_Co_3N":"hand_weapons",		
	"AIRetrofits_Co_3C":0.05,

	#settings for crewPower and Priority
	"AIRetrofits_Salvage_Power":1,
	"AIRetrofits_Salvage_priority":9,

	"AIRetrofits_Survey_Power":1.5,
	"AIRetrofits_Survey_priority":9,

	"AIRetrofits_Combat_Power":0.5,
	"AIRetrofits_Combat_priority":9,

}

